In [12]:
import pandas as pd
import numpy as np

In [13]:
#making a dictionary : dic_1
dic_1 = {
    "name":['satyam', 'shivam', 'puja','shubham','radha'],
    "mark":[98 , 95 , 90 , 80 , 89] ,
    "Age": [22 , 18 , 21 , 27 , 32] ,
    "city":['pune' , 'ahamadnagar' , 'ashti' , 'beed' , 'mumbai' ] ,
    "gender":['male','male','female','male','female'] ,
}

In [14]:
df = pd.DataFrame(dic_1)   # df name ka variable making and to make in a sheet of data
df                         # print df of a sheet data

      name  mark  Age         city  gender
0   satyam    98   22         pune    male
1   shivam    95   18  ahamadnagar    male
2     puja    90   21        ashti  female
3  shubham    80   27         beed    male
4    radha    89   32       mumbai  female

In [15]:
df.to_csv('first_sheet_pd.csv')

In [5]:
df.to_csv("create_no_index_sheet.csv" , index=False)

In [16]:
sheet = pd.read_csv("second_new_sheet.csv")   
sheet

      name  mark  Age         city  gender  cource
0   satyam    98   22         pune    male   mtech
1   shivam    95   18  ahamadnagar    male    12th
2     puja    90   21        ashti  female  noidea
3  shubham    80   27         beed    male    bams
4    radha    89   32       mumbai  female     phd

In [17]:
sheet['name'][1]

'shivam'

In [33]:
sheet['gender'][1] = 'female'

C:\Users\HP\AppData\Local\Temp\ipykernel_10728\2052337378.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  sheet['gender'][1] = 'female'
C:\Users\HP\AppData\Local\Temp\ipykernel_10728\2052337378.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sheet['gender'][1] = 'female'

In [34]:
sheet['name'][1] = Pratiksha

NameError: name 'Pratiksha' is not defined

In [35]:
sheet

        name  mark  Age         city  gender  cource
0     satyam    98   22         pune    male   mtech
1  pratiksha    95   18  ahamadnagar  female    12th
2       puja    90   21        ashti  female  noidea
3    shubham    80   27         beed    male    bams
4      radha    89   32       mumbai  female     phd

In [38]:
ser = pd.Series(np.random.rand)

In [39]:
ser

0    <bound method RandomState.rand of RandomState(...
dtype: object

In [46]:
ser = pd.Series(np.random.rand(30))
ser

0     0.574540
1     0.904693
2     0.538252
3     0.411509
4     0.589508
5     0.456385
6     0.086942
7     0.841203
8     0.854711
9     0.245323
10    0.104841
11    0.689183
12    0.948558
13    0.580041
14    0.155048
15    0.380612
16    0.454109
17    0.621038
18    0.010297
19    0.799502
20    0.662273
21    0.441805
22    0.575778
23    0.853877
24    0.069181
25    0.519819
26    0.384568
27    0.889839
28    0.193768
29    0.703502
dtype: float64

In [42]:
type(ser)

pandas.core.series.Series

In [45]:
newdf = pd.DataFrame(np.random.rand(333,6) , index=np.arange(333))
newdf

            0         1         2         3         4         5
0    0.405303  0.792329  0.497487  0.262761  0.158230  0.427269
1    0.674108  0.358464  0.857354  0.640290  0.395141  0.951875
2    0.364865  0.972921  0.810319  0.959341  0.594281  0.457285
3    0.640037  0.387602  0.026064  0.200126  0.196652  0.505512
4    0.863756  0.705460  0.059057  0.958334  0.940748  0.767915
..        ...       ...       ...       ...       ...       ...
328  0.761638  0.420385  0.704594  0.628425  0.275393  0.565512
329  0.083827  0.523188  0.739614  0.847699  0.292975  0.393766
330  0.529304  0.451856  0.120278  0.900566  0.699841  0.473394
331  0.051460  0.618596  0.851544  0.893384  0.597111  0.422386
332  0.755337  0.295598  0.047914  0.525326  0.322517  0.239672

[333 rows x 6 columns]

In [47]:
newdf.describe()

                0           1           2           3           4           5
count  333.000000  333.000000  333.000000  333.000000  333.000000  333.000000
mean     0.513882    0.507192    0.493287    0.475613    0.507341    0.511630
std      0.280035    0.291250    0.286463    0.279596    0.290273    0.289071
min      0.003432    0.001844    0.003003    0.002400    0.000385    0.001529
25%      0.266139    0.255318    0.226498    0.211574    0.275393    0.260139
50%      0.536201    0.529402    0.498534    0.484407    0.501004    0.528629
75%      0.756467    0.735329    0.748597    0.707487    0.766478    0.767915
max      0.998524    0.997450    0.997995    0.997447    0.997628    0.997567

In [50]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
5    float64
dtype: object

In [51]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [52]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       323, 324, 325, 326, 327, 328, 329, 330, 331, 332],
      dtype='int64', length=333)